In [1]:
import pandas as pd
import numpy as np

pd.__version__

'0.24.2'

In [3]:
a = pd.Series(np.arange(20,30))
print(a)

0    20
1    21
2    22
3    23
4    24
5    25
6    26
7    27
8    28
9    29
dtype: int32

In [5]:
a[1]

21

In [6]:
a[4:8]

4    24
5    25
6    26
7    27
dtype: int32

In [10]:
b = pd.Series([30,40,50,60], index = ['a','b','c','d'])
b

a    30
b    40
c    50
d    60
dtype: int64

In [13]:
c = pd.Series([30,40,50,60], index = [2,4.4,5,5])
c

2.0    30
4.4    40
5.0    50
5.0    60
dtype: int64

In [16]:
d2 = {'cal':20,'bis':[2,3,4],'jip': (3,5,'n'),'f':{7,8,9}}

l = pd.Series(d2)
l

cal           20
bis    [2, 3, 4]
jip    (3, 5, n)
f      {8, 9, 7}
dtype: object

In [20]:
name = {'Taral':'Dombivli','Sagar':"Kalewadi",'Pratik':"Pune","Pukhraj":"Rajasthan"}
Age =  {'Taral':21,'Sagar':22,'Pratik':22,"Pukhraj":27}

pd.DataFrame({'Name':name, 'age':Age})

              Name  age
Pratik        Pune   22
Pukhraj  Rajasthan   27
Sagar     Kalewadi   22
Taral     Dombivli   21

In [27]:
pd.DataFrame(np.random.randint(0,5,(3,3)),columns=['Tea','Coffee',"Pizza"], index = [4,5,6] )

   Tea  Coffee  Pizza
4    2       2      3
5    3       0      4
6    2       2      1

In [51]:
s = pd.Series(['Tom','Cat','Tom','Goat'],index = ['a','b','c','d'])

s['a':'c']

a    Tom
b    Cat
c    Tom
dtype: object

In [32]:
s[ :'c']

a      Tom
b      Cat
c    Horse
dtype: object

In [33]:
s[(s=='Tom')]

a    Tom
dtype: object

In [52]:
l=s[(s=='Tom') | (s =='Cat')]
l

a    Tom
b    Cat
c    Tom
dtype: object

In [79]:
import pandas as pd
name = {'Taral':30,"Sagar":32,"Hitesh":36,"Pratik":40}
age =  {'Taral':21,'Sagar':22,'Hitesh':22,"Pratik":27}
s = pd.DataFrame({"Marks1":name,"Marks2":age})
s

        Marks1  Marks2
Hitesh      36      22
Pratik      40      27
Sagar       32      22
Taral       30      21

In [72]:
s['total']= s['Marks1'] + s['Marks2']
s

        Marks1  Marks2  total
Hitesh      36      22     58
Pratik      40      27     67
Sagar       32      22     54
Taral       30      21     51

In [73]:
s.iloc[:3,:2]

        Marks1  Marks2
Hitesh      36      22
Pratik      40      27
Sagar       32      22

In [78]:
s.ix[:3,:'Marks1']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

        Marks1
Hitesh      36
Pratik      40
Sagar       32

In [1]:
import pandas as pd
import numpy as np

a = pd.Series(np.random.rand(4), index = [1,2,3,4])
a
a[h]

1    0.026856
2    0.674001
3    0.368260
4    0.468748
dtype: float64

In [ ]:
b = np.random.RandomState